const schedules = {
    rus: {
        1: {
            monday: ["Математика", "Русский язык", "Физкультура", "ИЗО"],
            tuesday: ["Английский", "История", "Математика", "Биология"],
            wednesday: ["Русский язык", "Физика", "Музыка", "География"],
            thursday: ["Математика", "Литература", "Физкультура", "Химия"],
            friday: ["История", "Русский язык", "Математика", "Английский"],
            saturday: ["Биология", "ИЗО", "Физика"]
        },
        2: {
            monday: ["Математика", "Русский язык", "Физкультура", "ИЗО"],
            tuesday: ["Английский", "История", "Математика", "Биология"],
            wednesday: ["Русский язык", "Физика", "Музыка", "География"],
            thursday: ["Математика", "Литература", "Физкультура", "Химия"],
            friday: ["История", "Русский язык", "Математика", "Английский"],
            saturday: ["Биология", "ИЗО", "Физика"]
        },
        3: {
            monday: ["Математика", "Русский язык", "Физкультура", "ИЗО"],
            tuesday: ["Английский", "История", "Математика", "Биология"],
            wednesday: ["Русский язык", "Физика", "Музыка", "География"],
            thursday: ["Математика", "Литература", "Физкультура", "Химия"],
            friday: ["История", "Русский язык", "Математика", "Английский"],
            saturday: ["Биология", "ИЗО", "Физика"]
        },
        // Добавьте расписание для остальных классов
    },
    taj: {
        1: {
            monday: ["Математика", "Русский", "Физкультура", "ИЗО"],
            tuesday: ["Английский", "История", "Математика", "Биология"],
            wednesday: ["Русский", "Физика", "Музыка", "География"],
            thursday: ["Математика", "Литература", "Физкультура", "Химия"],
            friday: ["История", "Русский", "Математика", "Английский"],
            saturday: ["Биология", "ИЗО", "Физика"]
        },
        2: {
            monday: ["Математика", "Русский", "Физкультура", "ИЗО"],
            tuesday: ["Английский", "История", "Математика", "Биология"],
            wednesday: ["Русский", "Физика", "Музыка", "География"],
            thursday: ["Математика", "Литература", "Физкультура", "Химия"],
            friday: ["История", "Русский", "Математика", "Английский"],
            saturday: ["Биология", "ИЗО", "Физика"]
        },
        3: {
            monday: ["Математика", "Русский", "Физкультура", "ИЗО"],
            tuesday: ["Английский", "История", "Математика", "Биология"],
            wednesday: ["Русский", "Физика", "Му